fork-the-planet/rx-driver-package/source/r_ble_da14531_rx/r_ble_da1453x_rx_vx.xx/r_ble_da1453x_rx/src/rm_abs/rm_ble_abs_api.h
/*
* Copyright (c) 2020 - 2025 Renesas Electronics Corporation and/or its affiliates
*
* SPDX-License-Identifier: BSD-3-Clause
*/

#ifndef RM_BLE_ABS_API_H
#define RM_BLE_ABS_API_H

/******************************************************************************************************************//**
 * @ingroup RENESAS_NETWORKING_INTERFACES
 * @defgroup BLE_ABS_API BLE ABS Interface
 * @brief Interface for BLE Abstraction functions.
 *
 * @section BLE_ABS_API_Summary Summary
 * The BLE Abstraction (BLE ABS) interface provides an abstraction layer for various Renesas BLE hardware.
 *
 *
 * @{
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Includes
 *********************************************************************************************************************/

/* Register definitions, common services and error codes. */
#include "platform.h"
#include "r_ble_api.h"
#include "r_sci_rx_if.h"
#include "r_sci_rx_pinset.h"
#include "r_ble_da1453x_config.h"

/* Common macro for FSP header files. There is also a corresponding FSP_FOOTER macro at the end of this file. */
FSP_HEADER

/**********************************************************************************************************************
 * Macro definitions
 *********************************************************************************************************************/

/* Configure ABS */
#define BLE_ABS_CFG_TIMER_NUMBER_OF_SLOT            (10)
#define BLE_ABS_CFG_GATT_MTU_SIZE                   (247)
#define BLE_ABS_CFG_RF_CONNECTION_MAXIMUM           (1)
#define BLE_ABS_CFG_TRANSMIT_POWER_INDEX            (34)

#define BLE_ABS_ADVERTISING_PHY_LEGACY    (0x00) ///< Non-Connectable Legacy Advertising phy setting.
#define BLE_BD_ADDR_LEN                   (0x06)

/* SPECIFY WHETHER TO USE UART TRANSPORT LAYER INTERFACE */
/* Setting an equate to 1 includes code specific to that transport layer interface. */
#define BLE_CFG_TRANSPORT_INTERFACE_UART     1

/* Configure RF connection maximum */
#define BLE_CFG_RF_CONN_MAX                         (1)

/* Configure select device */
#define DA14531_DEVICE      (1)
#define DA14535_DEVICE      (2)

/* Configure 2 wire UART */
#if (2 == BLE_CFG_HOST_BOOT_MODE) && (DA14531_DEVICE == BLE_CFG_DA1453X_DEVICE)

#define DA1453X_GTL_UART_RX_PIN     1
#define DA1453X_GTL_UART_TX_PIN     0
#define DA1453X_GTL_POR_PIN         9
#else
#define DA1453X_GTL_UART_RX_PIN     5
#define DA1453X_GTL_UART_TX_PIN     6
#define DA1453X_GTL_POR_PIN         0
#endif
/**********************************************************************************************************************
 * Typedef definitions
 *********************************************************************************************************************/
/* SCI configuration */
typedef struct
{
    sci_ch_t ch;           /* SCI channel */
    void (*func)(void);    /* Function name of SCI Port configuration */
    uint16_t tx_size;      /* TX buffer size */
    uint16_t rx_size;      /* RX buffer size */
} st_sci_conf_t;

/* SCI table information */
typedef struct
{
    sci_hdl_t   sci_hdl;
    sci_cfg_t   sci_config;
    volatile uint8_t tx_end_flag;
} st_sci_tbl_t;

/** Advertising Filter Policy */
typedef enum e_ble_abs_advertising_filter
{
    BLE_ABS_ADVERTISING_FILTER_ALLOW_ANY        = 0x00, ///< Receive a connect request from all devices.
    BLE_ABS_ADVERTISING_FILTER_ALLOW_WHITE_LIST = 0x01, ///< Receive a connect request from only the devices 
                                                        ///< registered in White List.
} ble_abs_advertising_filter_t;

/** Local keys delete policy */
typedef enum e_ble_abs_local_bond_information
{
    BLE_ABS_LOCAL_BOND_INFORMATION_NONE = 0x00, ///< Delete no local keys.
    BLE_ABS_LOCAL_BOND_INFORMATION_ALL  = 0x03, ///< Delete all local keys.
} ble_abs_local_bond_information_t;

/** Remote keys delete policy */
typedef enum e_ble_abs_remote_bond_information
{
    BLE_ABS_REMOTE_BOND_INFORMATION_NONE      = 0x00, ///< Delete no remote device keys.
    BLE_ABS_REMOTE_BOND_INFORMATION_SPECIFIED = 0x01, ///< Delete the keys specified by the device address.
    BLE_ABS_REMOTE_BOND_INFORMATION_ALL       = 0x03, ///< Delete all remote device keys.
} ble_abs_remote_bond_information_t;

/** Deletion policy for non-volatile memory */
typedef enum e_ble_abs_delete_non_volatile_area
{
    BLE_ABS_DELETE_NON_VOLATILE_AREA_DISABLE = 0x00, ///< Delete no keys stored in storage.
    BLE_ABS_DELETE_NON_VOLATILE_AREA_ENABLE  = 0x01, ///< Delete the keys stored in storage.
} ble_abs_delete_non_volatile_area_t;

/** st_ble_device_address is the type of bluetooth device address(BD_ADDR). */
typedef struct st_ble_device_address
{
    uint8_t addr[BLE_BD_ADDR_LEN];     ///< bluetooth device address.
    uint8_t type;                      ///< the type of bluetooth device address.
} ble_device_address_t;

/** ble_gap_application_callback_t is the GAP Event callback function type. */
typedef void (* ble_gap_application_callback_t)(uint16_t event_type, ble_status_t event_result,
                                                st_ble_evt_data_t * p_event_data);

/** ble_vendor_specific_application_callback_t is the Vendor Specific Event callback function type. */
typedef void (* ble_vendor_specific_application_callback_t)(uint16_t event_type, ble_status_t event_result,
                                                            st_ble_vs_evt_data_t * p_event_data);

/** ble_gatt_server_application_callback_t is the GATT Server Event callback function type. */
typedef void (* ble_gatt_server_application_callback_t)(uint16_t event_type, ble_status_t event_result,
                                                        st_ble_gatts_evt_data_t * p_event_data);

/** ble_gatt_client_application_callback_t is the GATT Server Event callback function type. */
typedef void (* ble_gatt_client_application_callback_t)(uint16_t event_type, ble_status_t event_result,
                                                        st_ble_gattc_evt_data_t * p_event_data);

/** ble_abs_delete_bond_application_callback_t is the delete bond information Event callback function type. */
typedef void (* ble_abs_delete_bond_application_callback_t)(st_ble_dev_addr_t * p_addr);

