fork-the-planet/rx-driver-package/source/r_ble_da14531_rx/r_ble_da1453x_rx_vx.xx/r_ble_da1453x_rx/src/rm_abs/rm_ble_abs_api.h
/** BLE ABS configuration parameters. */
typedef struct st_ble_abs_cfg
{
    /** the parameters for initialization. */
    uint32_t channel;                   ///< Select a channel corresponding to the channel number of the hardware.
    ble_gap_application_callback_t             gap_callback;                ///< GAP callback function.
    ble_vendor_specific_application_callback_t vendor_specific_callback;    ///< Vendor Specific callback function.
    ble_abs_gatt_server_callback_set_t       * p_gatt_server_callback_list; ///< GATT Server callback set.
    uint8_t gatt_server_callback_list_number;            ///< The number of GATT Server callback functions.
    ble_abs_gatt_client_callback_set_t * p_gatt_client_callback_list;       ///< GATT Client callback set.
    uint8_t gatt_client_callback_list_number;            ///< The number of GATT Client callback functions.
    ble_abs_pairing_parameter_t * p_pairing_parameter;                      ///< Pairing parameters.
#if defined(BLE_CFG_TRANSPORT_INTERFACE_UART)
    st_sci_tbl_t         p_sci_instance;                        ///< SCI UART instance
#endif
    void (* p_callback)(ble_abs_callback_args_t * p_args);     ///< Callback provided when a BLE ISR occurs.
    void       * p_context;    ///< Placeholder for user data.  Passed to the user callback in ble_abs_callback_args_t.
    void const * p_extend;                                     ///< Placeholder for user extension.
} ble_abs_cfg_t;

/** BLE ABS functions implemented at the HAL layer will follow this API. */
typedef struct st_ble_abs_api
{
    /** Initialize the BLE ABS in register start mode.
     *
     * @param[in]  p_ctrl       Pointer to control structure.
     * @param[in]  p_cfg        Pointer to pin configuration structure.
     */
    fsp_err_t (* open)(ble_abs_ctrl_t * const p_ctrl, ble_abs_cfg_t const * const p_cfg);

    /** Close the BLE ABS.
     *
     * @param[in]  p_ctrl       Pointer to control structure.
     */
    fsp_err_t (* close)(ble_abs_ctrl_t * const p_ctrl);

    /** Close the BLE ABS.
     *
     * @param[in]  p_ctrl        Pointer to control structure.
     * @param[in]  init_callback callback function to initialize Host Stack.
     */
    fsp_err_t (* reset)(ble_abs_ctrl_t * const p_ctrl, ble_event_cb_t init_callback);

    /** Start Legacy Connectable Advertising.
     * @param[in]  p_ctrl       Pointer to control structure.
     * @param[in]  p_advertising_parameter        Pointer to Advertising parameters for Legacy Advertising.
     */
    fsp_err_t (* startLegacyAdvertising)(ble_abs_ctrl_t * const                               p_ctrl,
                                         ble_abs_legacy_advertising_parameter_t const * const p_advertising_parameter);

    /** Start Extended Connectable Advertising.
     * @param[in]  p_ctrl       Pointer to control structure.
     * @param[in]  p_advertising_parameter        Pointer to Advertising parameters for extend Advertising.
     */
    fsp_err_t (* startExtendedAdvertising)(
        ble_abs_ctrl_t * const                               p_ctrl,
        ble_abs_extend_advertising_parameter_t const * const p_advertising_parameter);

    /** Start Non-Connectable Advertising.
     * @param[in]  p_ctrl       Pointer to control structure.
     * @param[in]  p_advertising_parameter        Pointer to Advertising parameters for non-connectable Advertising.
     */
    fsp_err_t (* startNonConnectableAdvertising)(ble_abs_ctrl_t * const p_ctrl,
                                                 ble_abs_non_connectable_advertising_parameter_t const * const
                                                 p_advertising_parameter);

    /** Start Periodic Advertising.
     * @param[in]  p_ctrl       Pointer to control structure.
     * @param[in]  p_advertising_parameter        Pointer to Advertising parameters for periodic Advertising.
     */
    fsp_err_t (* startPeriodicAdvertising)(ble_abs_ctrl_t * const p_ctrl,
                                           ble_abs_periodic_advertising_parameter_t const * const
                                           p_advertising_parameter);

    /** Start scanning.
     * @param[in]  p_ctrl       Pointer to control structure.
     * @param[in]  p_scan_parameter        Pointer to scan parameter.
     */
    fsp_err_t (* startScanning)(ble_abs_ctrl_t * const p_ctrl,
                                ble_abs_scan_parameter_t const * const p_scan_parameter);

    /** Request create connection.
     * @param[in]  p_ctrl       Pointer to control structure.
     * @param[in]  p_connection_parameter        Pointer to connection parameter.
     */
    fsp_err_t (* createConnection)(ble_abs_ctrl_t * const                       p_ctrl,
                                   ble_abs_connection_parameter_t const * const p_connection_parameter);

    /** Configure local device privacy.
     * @param[in]  p_ctrl       Pointer to control structure.
     * @param[in]  p_lc_irk        Pointer to IRK (Identity Resolving Key) to be registered in the resolving list.
     * @param[in]  privacy_mode        privacy_mode privacy mode.
     */
    fsp_err_t (* setLocalPrivacy)(ble_abs_ctrl_t * const p_ctrl, uint8_t const * const p_lc_irk, uint8_t privacy_mode);

    /** Start pairing or encryption.
     * @param[in]  p_ctrl       Pointer to control structure.
     * @param[in]  connection_handle        Connection handle identifying the remote device.
     */
    fsp_err_t (* startAuthentication)(ble_abs_ctrl_t * const p_ctrl, uint16_t connection_handle);

    /** Delete bond information.
     * @param[in]  p_ctrl       Pointer to control structure.
     * @param[in]  p_bond_information_parameter   Pointer to bond information parameter.
     */
    fsp_err_t (* deleteBondInformation)(
        ble_abs_ctrl_t * const                             p_ctrl,
        ble_abs_bond_information_parameter_t const * const p_bond_information_parameter);

    /** Import local identity address, keys information to local storage.
     * @param[in]  p_ctrl       Pointer to control structure.
     * @param[in]  p_local_identity_address Pointer to local identiry address.
     * @param[in]  uint8_t  p_local_irk Pointer to local IRK (Identity Resolving Key)
     * @param[in]  uint8_t  p_local_csrk    Pointer to local CSRK
     */
    fsp_err_t (* importKeyInformation)(ble_abs_ctrl_t * const p_ctrl,
                                       ble_device_address_t * p_local_identity_address,
                                       uint8_t * p_local_irk,
                                       uint8_t * p_local_csrk);

    /** Export local identity address, keys information from local storage.
     * @param[in]   p_ctrl       Pointer to control structure.
     * @param[out]  p_local_identity_address Pointer to local identiry address.
     * @param[out]  uint8_t  p_local_irk Pointer to local IRK (Identity Resolving Key)
     * @param[out]  uint8_t  p_local_csrk    Pointer to local CSRK
     */
    fsp_err_t (* exportKeyInformation)(ble_abs_ctrl_t * const p_ctrl,
                                       ble_device_address_t * p_local_identity_address,
                                       uint8_t * p_local_irk,
                                       uint8_t * p_local_csrk);
} ble_abs_api_t;

/** This structure encompasses everything that is needed to use an instance of this interface. */
typedef struct st_ble_abs_instance
{
    ble_abs_ctrl_t      * p_ctrl;      ///< Pointer to the control structure for this instance
    ble_abs_cfg_t const * p_cfg;       ///< Pointer to the configuration structure for this instance
    ble_abs_api_t const * p_api;       ///< Pointer to the API structure for this instance
} ble_abs_instance_t;

/******************************************************************************************************************//**
 * @} (end addtogroup BLE_ABS_API)
 *********************************************************************************************************************/

/* Common macro for FSP header files. There is also a corresponding FSP_HEADER macro at the top of this file. */
FSP_FOOTER

#endif
